IRP/src/AccumulationRegisters/R3035T_CashPlanning/R3035T_CashPlanning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R3035T_CashPlanning</name>
 <registerType>Turnovers</registerType>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BasisDocument</name>
  <type>
   <types>DefinedType.typePlaningTransactionBasises</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CashFlowDirection</name>
  <type>
   <types>EnumRef.CashFlowDirections</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>FinancialMovementType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningPeriod</name>
  <type>
   <types>CatalogRef.PlanningPeriods</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/CashFlowDirections/CashFlowDirections.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CashFlowDirections</name>
 <enumValues>
  <name>Incoming</name>
 </enumValues>
 <enumValues>
  <name>Outgoing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/BankPayment/BankPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>BankPayment</name>
 <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R3011T_CashFlow</registerRecords>
 <registerRecords>AccumulationRegister.R3027B_EmployeeCashAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
 <registerRecords>AccumulationRegister.R3025B_PurchaseOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.R3021B_CashInTransitIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R3050T_PosCashBalances</registerRecords>
 <registerRecords>AccumulationRegister.R3035T_CashPlanning</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R3010B_CashOnHand</registerRecords>
 <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R9510B_SalaryPayment</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.CashInTransit</registerRecords>
 <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R2023B_AdvancesFromRetailCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.OutgoingPaymentTransactionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TransitAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>DocNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>RRNCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>30</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PaymentInfo</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>ConsolidatedRetailSales</name>
  <type>
   <types>DocumentRef.ConsolidatedRetailSales</types>
  </type>
 </attributes>
 <attributes>
  <name>DetailsByRow</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>PaymentList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisDocument</name>
   <type>
    <types>DefinedType.typeApTransactionBasises</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>NetAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TotalAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>PlaningTransactionBasis</name>
   <type>
    <types>DefinedType.typePlaningTransactionBasises</types>
   </type>
  </attributes>
  <attributes>
   <name>DELETE_Commission</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>AdditionalAnalytic</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>FinancialMovementType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>CashFlowCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalNameContract</name>
   <type>
    <types>CatalogRef.LegalNameContracts</types>
   </type>
  </attributes>
  <attributes>
   <name>Order</name>
   <type>
    <types>DocumentRef.PurchaseOrder</types>
   </type>
  </attributes>
  <attributes>
   <name>PaymentType</name>
   <type>
    <types>CatalogRef.PaymentTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>PaymentTerminal</name>
   <type>
    <types>CatalogRef.PaymentTerminals</types>
   </type>
  </attributes>
  <attributes>
   <name>BankTerm</name>
   <type>
    <types>CatalogRef.BankTerms</types>
   </type>
  </attributes>
  <attributes>
   <name>DELETE_CommissionPercent</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>6</precision>
     <scale>2</scale>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>RetailCustomer</name>
   <type>
    <types>CatalogRef.RetailCustomers</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>PaymentPeriod</name>
   <type>
    <types>CatalogRef.PlanningPeriods</types>
   </type>
  </attributes>
  <attributes>
   <name>ReceiptingAccount</name>
   <type>
    <types>CatalogRef.CashAccounts</types>
   </type>
  </attributes>
  <attributes>
   <name>ReceiptingBranch</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
  <attributes>
   <name>Branch</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxDiscountAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DELETE_TaxList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>Analytics</name>
   <type>
    <types>CatalogRef.TaxAnalytics</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IncludeToTotalAmount</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ManualAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/CommonModules/DocMoneyTransferServer/Module.bsl
#Region FORM

Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	If Form.Parameters.Key.IsEmpty() Then
		SetGroupItemsList(Object, Form);
		DocumentsClientServer.ChangeTitleGroupTitle(Object, Form);
	EndIf;
	ViewServer_V2.OnCreateAtServer(Object, Form, "");
EndProcedure

Procedure AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters) Export
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	If Not Form.GroupItems.Count() Then
		SetGroupItemsList(Object, Form);
	EndIf;
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
EndProcedure

#EndRegion

#Region GENERATE_BY_BASIS

Function GetDocumentTable_CashTransferOrder(ArrayOfBasisDocuments, EndOfDate = Undefined) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	R3035T_CashPlanning.BasisDocument AS BasisDocument,
	|	R3035T_CashPlanning.Recorder AS Recorder
	|FROM
	|	AccumulationRegister.R3035T_CashPlanning AS R3035T_CashPlanning
	|WHERE
	|	R3035T_CashPlanning.BasisDocument IN (&ArrayOfBasisDocuments)
	|	AND (R3035T_CashPlanning.Recorder REFS Document.BankPayment
	|	OR R3035T_CashPlanning.Recorder REFS Document.BankReceipt
	|	OR R3035T_CashPlanning.Recorder REFS Document.CashPayment
	|	OR R3035T_CashPlanning.Recorder REFS Document.CashReceipt)
	|	AND
	|		R3035T_CashPlanning.CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)";
	Query.SetParameter("ArrayOfBasisDocuments", ArrayOfBasisDocuments);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	ArrayOfBasisDocumentsClear = New Array();
	For Each BasisDocument In ArrayOfBasisDocuments Do
		If Not QuerySelection.FindNext(BasisDocument, "BasisDocument") Then
			ArrayOfBasisDocumentsClear.Add(BasisDocument);
		EndIf;
	EndDo;
	If Not ArrayOfBasisDocumentsClear.Count() Then
		// error, BP/BR/CP/CR exists
		Return New ValueTable();
	EndIf;
	
	TempTableManager = New TempTablesManager();
	Query = New Query();
	Query.TempTablesManager = TempTableManager;
	Query.Text = GetDocumentTable_CashTransferOrder_QueryText();
	Query.SetParameter("ArrayOfBasisDocuments", ArrayOfBasisDocumentsClear);
	Query.SetParameter("UseArrayOfBasisDocuments", True);
	If EndOfDate = Undefined Then
		Query.SetParameter("EndOfDate", CurrentDate());
	Else
		Query.SetParameter("EndOfDate", EndOfDate);
	EndIf;

	Query.Execute();
	Query.Text =
	"SELECT
	|	tmp.BasedOn,
	|	tmp.Company,
	|	tmp.Branch,
	|	tmp.CashTransferOrder,
	|	tmp.Sender,
	|	tmp.SendCurrency,
	|	tmp.SendFinancialMovementType,
	|	tmp.SendAmount,
	|	tmp.Receiver,
	|	tmp.ReceiveCurrency,
	|	tmp.ReceiveFinancialMovementType,
	|	tmp.ReceiveAmount
	|FROM
	|	tmp_CashTransferOrder AS tmp";
	QueryResult = Query.Execute();
	Return QueryResult.Unload();
EndFunction

Function GetDocumentTable_CashTransferOrder_QueryText() Export
	Return 
	"SELECT ALLOWED
	|	""CashTransferOrder"" AS BasedOn,
	|	Incoming.Company AS Company,
	|	Incoming.Branch AS Branch,
	|	Incoming.Account AS Receiver,
	|	Incoming.Currency AS ReceiveCurrency,
	|	Incoming.FinancialMovementType AS ReceiveFinancialMovementType,
	|	Incoming.AmountTurnover AS ReceiveAmount,
	|	Incoming.BasisDocument AS CashTransferOrder
	|INTO tmp_Incoming
	|FROM
	|	AccumulationRegister.R3035T_CashPlanning.Turnovers(, &EndOfDate,,
	|		CashFlowDirection = VALUE(Enum.CashFlowDirections.Incoming)
	|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|	AND CASE
	|		WHEN &UseArrayOfBasisDocuments
	|			THEN BasisDocument IN (&ArrayOfBasisDocuments)
	|		ELSE TRUE
	|	END) AS Incoming
	|		INNER JOIN Document.CashTransferOrder AS Doc
	|		ON Incoming.BasisDocument = Doc.Ref
	|WHERE
	|	Incoming.AmountTurnover > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT ALLOWED
	|	""CashTransferOrder"" AS BasedOn,
	|	Outgoing.Company AS Company,
	|	Outgoing.Branch AS Branch,
	|	Outgoing.Account AS Sender,
	|	Outgoing.Currency AS SendCurrency,
	|	Outgoing.FinancialMovementType AS SendFinancialMovementType,
	|	Outgoing.AmountTurnover AS SendAmount,
	|	Outgoing.BasisDocument AS CashTransferOrder
	|INTO tmp_Outgoing
	|FROM
	|	AccumulationRegister.R3035T_CashPlanning.Turnovers(, &EndOfDate,,
	|		CashFlowDirection = VALUE(Enum.CashFlowDirections.Outgoing)
	|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|	AND CASE
	|		WHEN &UseArrayOfBasisDocuments
	|			THEN BasisDocument IN (&ArrayOfBasisDocuments)
	|		ELSE TRUE
	|	END) AS Outgoing
	|		INNER JOIN Document.CashTransferOrder AS Doc
	|		ON Outgoing.BasisDocument = Doc.Ref
	|WHERE
	|	Outgoing.AmountTurnover > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ISNULL(tmp_Outgoing.BasedOn, tmp_Incoming.BasedOn) AS BasedOn,
	|	ISNULL(tmp_Outgoing.Company, tmp_Incoming.Company) AS Company,
	|	ISNULL(tmp_Outgoing.Branch, tmp_Incoming.Branch) AS Branch,
	|	ISNULL(tmp_Outgoing.CashTransferOrder, tmp_Incoming.CashTransferOrder) AS CashTransferOrder,
	|	tmp_Outgoing.Sender AS Sender,
	|	tmp_Outgoing.SendCurrency AS SendCurrency,
	|	tmp_Outgoing.SendFinancialMovementType AS SendFinancialMovementType,
	|	tmp_Outgoing.SendAmount AS SendAmount,
	|	tmp_Incoming.Receiver AS Receiver,
	|	tmp_Incoming.ReceiveCurrency AS ReceiveCurrency,
	|	tmp_Incoming.ReceiveFinancialMovementType AS ReceiveFinancialMovementType,
	|	tmp_Incoming.ReceiveAmount AS ReceiveAmount
	|INTO tmp_CashTransferOrder
	|FROM
	|	tmp_Outgoing AS tmp_Outgoing
	|		FULL JOIN tmp_Incoming AS tmp_Incoming
	|		ON tmp_Outgoing.CashTransferOrder = tmp_Incoming.CashTransferOrder";
EndFunction

Function GetDocumentTable_CashTransferOrder_ForClient(ArrayOfBasisDocuments, ObjectRef = Undefined) Export
	EndOfDate = Undefined;
	If ValueIsFilled(ObjectRef) Then
		EndOfDate = New Boundary(ObjectRef.PointInTime(), BoundaryType.Excluding);
	EndIf;
	ArrayOfResults = New Array();
	ValueTable = GetDocumentTable_CashTransferOrder(ArrayOfBasisDocuments, EndOfDate);
	For Each Row In ValueTable Do
		NewRow = New Structure();
		NewRow.Insert("BasedOn"                      , Row.BasedOn);
		NewRow.Insert("Company"                      , Row.Company);
		NewRow.Insert("Branch"                       , Row.Branch);
		NewRow.Insert("CashTransferOrder"            , Row.CashTransferOrder);
		NewRow.Insert("Sender"                       , Row.Sender);
		NewRow.Insert("SendCurrency"                 , Row.SendCurrency);
		NewRow.Insert("SendFinancialMovementType"    , Row.SendFinancialMovementType);
		NewRow.Insert("SendAmount"                   , Row.SendAmount);
		NewRow.Insert("Receiver"                     , Row.Receiver);
		NewRow.Insert("ReceiveCurrency"              , Row.ReceiveCurrency);
		NewRow.Insert("ReceiveFinancialMovementType" , Row.ReceiveFinancialMovementType);
		NewRow.Insert("ReceiveAmount"                , Row.ReceiveAmount);
		ArrayOfResults.Add(NewRow);
	EndDo;
	Return ArrayOfResults;
EndFunction

#EndRegion

#Region LIST_FROM

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region CHOICE_FORM

Procedure OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region SERVICE

Procedure SetGroupItemsList(Object, Form)
	AttributesArray = New Array();
	AttributesArray.Add("Company");
	DocumentsServer.DeleteUnavailableTitleItemNames(AttributesArray);
	For Each Atr In AttributesArray Do
		Form.GroupItems.Add(Atr, ?(ValueIsFilled(Form.Items[Atr].Title), Form.Items[Atr].Title,
			Object.Ref.Metadata().Attributes[Atr].Synonym + ":" + Chars.NBSp));
	EndDo;
EndProcedure

#EndRegion
